RT-Thread/rt-thread/bsp/gd32vf103v-eval/libraries/GD32VF103_standard_peripheral/Source/gd32vf103_adc.c
/*!
    \brief      adc oversample mode config
    \param[in]  adc_periph: ADCx, x=0,1
    \param[in]  mode: ADC oversampling mode
                only one parameter can be selected which is shown as below:
      \arg        ADC_OVERSAMPLING_ALL_CONVERT: all oversampled conversions for a channel
                are done consecutively after a trigger
      \arg        ADC_OVERSAMPLING_ONE_CONVERT: each oversampled conversion for a channel
                needs a trigger
    \param[in]  shift: ADC oversampling shift
                only one parameter can be selected which is shown as below:
      \arg        ADC_OVERSAMPLING_SHIFT_NONE: no oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_1B: 1-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_2B: 2-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_3B: 3-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_4B: 3-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_5B: 5-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_6B: 6-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_7B: 7-bit oversampling shift
      \arg        ADC_OVERSAMPLING_SHIFT_8B: 8-bit oversampling shift
    \param[in]  ratio: ADC oversampling ratio
                only one parameter can be selected which is shown as below:
      \arg        ADC_OVERSAMPLING_RATIO_MUL2: oversampling ratio X2
      \arg        ADC_OVERSAMPLING_RATIO_MUL4: oversampling ratio X4
      \arg        ADC_OVERSAMPLING_RATIO_MUL8: oversampling ratio X8
      \arg        ADC_OVERSAMPLING_RATIO_MUL16: oversampling ratio X16
      \arg        ADC_OVERSAMPLING_RATIO_MUL32: oversampling ratio X32
      \arg        ADC_OVERSAMPLING_RATIO_MUL64: oversampling ratio X64
      \arg        ADC_OVERSAMPLING_RATIO_MUL128: oversampling ratio X128
      \arg        ADC_OVERSAMPLING_RATIO_MUL256: oversampling ratio X256
    \param[out] none
    \retval     none
*/
void adc_oversample_mode_config(uint32_t adc_periph, uint8_t mode, uint16_t shift,uint8_t ratio)
{
    if(mode){
        ADC_OVSCR(adc_periph) |= (uint32_t)ADC_OVSCR_TOVS;
    }else{
        ADC_OVSCR(adc_periph) &= ~((uint32_t)ADC_OVSCR_TOVS);
    }
    /* config the shift and ratio */
    ADC_OVSCR(adc_periph) &= ~((uint32_t)(ADC_OVSCR_OVSR | ADC_OVSCR_OVSS));
    ADC_OVSCR(adc_periph) |= ((uint32_t)shift | (uint32_t)ratio);
}

/*!
    \brief      enable ADC oversample mode
    \param[in]  adc_periph: ADCx, x=0,1
    \param[out] none
    \retval     none
*/
void adc_oversample_mode_enable(uint32_t adc_periph)
{
    ADC_OVSCR(adc_periph) |= ADC_OVSCR_OVSEN;
}

/*!
    \brief      disable ADC oversample mode
    \param[in]  adc_periph: ADCx, x=0,1
    \param[out] none
    \retval     none
*/
void adc_oversample_mode_disable(uint32_t adc_periph)
{
    ADC_OVSCR(adc_periph) &= ~((uint32_t)ADC_OVSCR_OVSEN);
}
